RT-Thread/rt-thread/bsp/gd32103c-eval/Libraries/CMSIS/GD/GD32F1xx/Source/system_gd32f1xx.c
/**
  ******************************************************************************
  * @brief   CMSIS Cortex-M3 Device Peripheral Access Layer System Source File.
  ******************************************************************************
  */

/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup GD32f10x_system
  * @{
  */

/** @addtogroup GD32f10x_System_Private_Includes
  * @{
  */

#include "gd32f10x.h"

/**
  * @}
  */

/** @addtogroup GD32f10x_System_Private_Variables
  * @{
  */

/* Uncomment the corresponding line to configure system clock that you need  */
/* The clock is from HSE oscillator clock  */
//#define SYSCLK_FREQ_HSE    HSE_VALUE
//#define SYSCLK_FREQ_24MHz  24000000
//#define SYSCLK_FREQ_36MHz  36000000
//#define SYSCLK_FREQ_48MHz  48000000
//#define SYSCLK_FREQ_56MHz  56000000
//#define SYSCLK_FREQ_72MHz  72000000
//#define SYSCLK_FREQ_96MHz  96000000
#define SYSCLK_FREQ_108MHz  108000000

/* Uncomment the corresponding line to configure system clock that you need  */
/* The clock is from HSI oscillator clock  */
//#define SYSCLK_FREQ_48MHz_HSI  48000000
//#define SYSCLK_FREQ_72MHz_HSI  72000000
//#define SYSCLK_FREQ_108MHz_HSI  108000000

/* ---------------------- RCC registers mask -------------------------------- */

/* RCC GCCR_HSIEN mask */
#define  SYS_GCCR_HSIEN_SET                                 ((uint32_t)0x00000001)

/* RCC GCFGR_Reset mask */
#define  SYS_GCFGR_RESET_CL                                 ((uint32_t)0xE0FF0000)
#define  SYS_GCFGR_RESET                                    ((uint32_t)0xE8FF0000)

/* RCC GCCR_HSEEN_CKMEN_PLLEN masks */
#define  SYS_GCCR_HSEEN_CKMEN_PLLEN_RESET                   ((uint32_t)0xFEF6FFFF)

/* RCC GCCR_HSEBPS mask */
#define  SYS_GCCR_HSEBPS_RESET                              ((uint32_t)0xFFFBFFFF)

/* RCC GCFGR_PLLSEL_PLLPREDV_PLLMF masks */
#define  SYS_GCFGR_PLLSEL_PLLPREDV_PLLMF_USBPS_RESET        ((uint32_t)0xF700FFFF)
#define  SYS_GCFGR_PLLSEL_PLLPREDV_PLLMF_USBPS_RESET_CL     ((uint32_t)0xDF00FFFF)

/* RCC GCCR_PLL2EN_PLL3EN masks */
#define  SYS_GCCR_PLL2EN_PLL3EN_RESET                       ((uint32_t)0xEBFFFFFF)

/* RCC GCFGR2 reset */
#define  SYS_GCFGR2_RESET                                   ((uint32_t)0x00000000)

/* RCC GCIR_INT ans FLAG masks */
#define  SYS_GCIR_INT_FLAG_RESET                            ((uint32_t)0x009F0000)
#define  SYS_GCIR_INT_FLAG_RESET_CL                         ((uint32_t)0x00FF0000)

#define  SYS_GCCR_HSEEN_HSEBPS_RESET                        ((uint32_t)0xFFF8FFFF)

/* RCC GCCR_HSIADJ masks */
#define  SYS_GCCR_HSIADJ_OFFSET                             ((uint32_t)0x00000003)


#define  SYS_RCC_GCFGR_PLLMF_3_0                            ((uint32_t)0x003C0000) /*!< PLLMF[3:0] Bits */

/* RCC HSI clock divided by 2 masks */
#define  SYS_HSI_CLOCK_DIVIDED_2                            ((uint32_t)0x00000001)



/**
  * @}
  */


/** @addtogroup GD32F10x_System_Private_Variables
  * @{
  */

/*******************************************************************************
*  System Clock Select
*******************************************************************************/
#ifdef SYSCLK_FREQ_HSE
    uint32_t SystemCoreClock         = SYSCLK_FREQ_HSE;
#elif defined SYSCLK_FREQ_24MHz
    uint32_t SystemCoreClock         = SYSCLK_FREQ_24MHz;
#elif defined SYSCLK_FREQ_36MHz
    uint32_t SystemCoreClock         = SYSCLK_FREQ_36MHz;
#elif defined SYSCLK_FREQ_48MHz
    uint32_t SystemCoreClock         = SYSCLK_FREQ_48MHz;
#elif defined SYSCLK_FREQ_56MHz
    uint32_t SystemCoreClock         = SYSCLK_FREQ_56MHz;
#elif defined SYSCLK_FREQ_72MHz
    uint32_t SystemCoreClock         = SYSCLK_FREQ_72MHz;
#elif defined SYSCLK_FREQ_96MHz
    uint32_t SystemCoreClock         = SYSCLK_FREQ_96MHz;
#elif defined SYSCLK_FREQ_108MHz
    uint32_t SystemCoreClock         = SYSCLK_FREQ_108MHz;
#elif defined SYSCLK_FREQ_48MHz_HSI
    uint32_t SystemCoreClock         = SYSCLK_FREQ_48MHz_HSI;
#elif defined SYSCLK_FREQ_72MHz_HSI
    uint32_t SystemCoreClock         = SYSCLK_FREQ_72MHz_HSI;
#elif defined SYSCLK_FREQ_108MHz_HSI
    uint32_t SystemCoreClock         = SYSCLK_FREQ_108MHz_HSI;
#else /*!< HSI Selected as System Clock source */
    uint32_t SystemCoreClock         = HSI_VALUE;        /*!< System Clock Frequency (Core Clock) */
#endif

__I uint8_t AHBPrescTableList[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};

/**
  * @}
  */

/** @addtogroup GD32f10x_System_Private_FunctionPrototypes
  * @{
  */

static void SetSysClock(void);

#ifdef SYSCLK_FREQ_HSE
    static void SetSysClockToHSE(void);
#elif defined SYSCLK_FREQ_24MHz
    static void SetSysClockTo24(void);
#elif defined SYSCLK_FREQ_36MHz
    static void SetSysClockTo36(void);
#elif defined SYSCLK_FREQ_48MHz
    static void SetSysClockTo48(void);
#elif defined SYSCLK_FREQ_56MHz
    static void SetSysClockTo56(void);
#elif defined SYSCLK_FREQ_72MHz
    static void SetSysClockTo72(void);
#elif defined SYSCLK_FREQ_96MHz
    static void SetSysClockTo96(void);
#elif defined SYSCLK_FREQ_108MHz
    static void SetSysClockTo108(void);
#elif defined SYSCLK_FREQ_48MHz_HSI
    static void SetSysClockTo48HSI(void);
#elif defined SYSCLK_FREQ_72MHz_HSI
    static void SetSysClockTo72HSI(void);
#elif defined SYSCLK_FREQ_108MHz_HSI
    static void SetSysClockTo108HSI(void);
#endif


/**
  * @}
  */

/** @addtogroup GD32f10x_System_Private_Functions
  * @{
  */

/**
  * @brief  Initialize the Embedded Flash Interface, the PLL and set the
  *         SystemCoreClock variable.
  * @param  None
  * @retval None
  */

void SystemInit(void)
{
    /* Set RCC GCCR_HSIEN mask */
    RCC->GCCR |= SYS_GCCR_HSIEN_SET;

    /* Reset SCS[1:0], AHBPS[3:0], APB1PS[2:0],APB2PS[2:0], ADCPS[2:0],CKOTUSEL[2:0] bits */
#ifdef GD32F10X_CL
    RCC->GCFGR &= SYS_GCFGR_RESET_CL;
#else
    RCC->GCFGR &= SYS_GCFGR_RESET;
#endif /* GD32F10X_CL */

    /* Reset HSEEN, CKMEN and PLLEN bits */
    RCC->GCCR &= SYS_GCCR_HSEEN_CKMEN_PLLEN_RESET;

    /* Reset HSEBPS bit */
    RCC->GCCR &= SYS_GCCR_HSEBPS_RESET;

    /* Reset PLLSEL, PLLPREDV and PLLMF[4:0] USBPS/OTGPS bits */
#ifdef GD32F10X_CL
    RCC->GCFGR &= SYS_GCFGR_PLLSEL_PLLPREDV_PLLMF_USBPS_RESET_CL;
#else
    RCC->GCFGR &= SYS_GCFGR_PLLSEL_PLLPREDV_PLLMF_USBPS_RESET;
#endif /* GD32F10X_CL */

#ifdef GD32F10X_CL
    /* Reset PLL2EN and PLL3EN bits */
    RCC->GCCR &= SYS_GCCR_PLL2EN_PLL3EN_RESET;

    /* Reset GCFGR2 register */
    RCC->GCFGR2 = SYS_GCFGR2_RESET ;

    /* Disable all interrupts and clear flag bits */
    RCC->GCIR = SYS_GCIR_INT_FLAG_RESET_CL;
#else
    /* Disable all interrupts and clear flag bits */
    RCC->GCIR = SYS_GCIR_INT_FLAG_RESET;
#endif /* GD32F10X_CL */

    /* Configure the System clock frequency, AHB, APB2 and APB1 prescalers */
    /* Configure the Flash Latency cycles and enable prefetch buffer */
    SetSysClock();
}

/**
  * @brief  Update SystemCoreClock according to RCC Register Values
  * @note   Update the SystemCoreClock variable values, when the core clock (HCLK) changes.
  *         Otherwise, any configuration based on this variable will be wrong.
  * @param  None
  * @retval None
  */
void SystemCoreClockUpdate(void)
{
    uint32_t temp = 0, pllmf = 0, pllmf4 = 0, pllselect = 0, presc = 0;

#ifdef  GD32F10X_CL
    uint32_t prediv1select = 0, prediv1factor = 0, prediv2factor = 0, pll2mf = 0;
#endif /* GD32F10X_CL */

    /* Get CK_SYS source -------------------------------------------------------*/
    temp = RCC->GCFGR & RCC_GCFGR_SCSS;

    switch (temp) {
    case 0x00:  /* HSI used as CK_SYS */
        SystemCoreClock = HSI_VALUE;
        break;
    case 0x04:  /* HSE used as CK_SYS */
        SystemCoreClock = HSE_VALUE;
        break;
    case 0x08:  /* PLL used as CK_SYS */
#ifdef  GD32F10X_CL
        /* Get PLL clock source and multiplication factor ----------------------*/
        /* Get PLLMF[3:0] */
        pllmf = RCC->GCFGR & SYS_RCC_GCFGR_PLLMF_3_0;
        /* Get PLLMF[4] */
        pllmf4 = RCC->GCFGR & RCC_GCFGR_PLLMF_4;

        pllmf4 = ((pllmf4 >> 29) * 15);

