RT-Thread/rt-thread/bsp/gd32103c-eval/Libraries/CMSIS/GD/GD32F1xx/Source/system_gd32f1xx.c
        pllmf = (pllmf >> 18) + pllmf4;
        if (pllmf != 0x0D) {
            pllmf += 2;
        } else {
            /* PLL multiplication factor = PLL input clock * 6.5 */
            pllmf = 13 / 2;
        }

        pllselect = RCC->GCFGR & RCC_GCFGR_PLLSEL;
        if (pllselect == 0x00) {
            /* HSI clock divided by 2 selected as PLL clock source */
            SystemCoreClock = (HSI_VALUE >> SYS_HSI_CLOCK_DIVIDED_2) * pllmf;
        } else {
            /* PREDIV1 selected as PLL clock entry */

            /* Get PREDIV1 clock source and division factor */
            prediv1select = RCC->GCFGR2 & RCC_GCFGR2_PREDV1SEL;
            prediv1factor = (RCC->GCFGR2 & RCC_GCFGR2_PREDV1) + 1;

            if (prediv1select == 0) {
                /* HSE clock selected as PREDIV1 clock entry */
                SystemCoreClock = (HSE_VALUE / prediv1factor) * pllmf;
            } else {
                /* PLL2 clock selected as PREDIV1 clock entry */
                /* Get PREDIV2 division factor and PLL2 multiplication factor */
                prediv2factor = ((RCC->GCFGR2 & RCC_GCFGR2_PREDV2) >> 4) + 1;
                pll2mf = ((RCC->GCFGR2 & RCC_GCFGR2_PLL2MF) >> 8);
                if (pll2mf != 15) {
                    pll2mf += 2;
                } else {
                    pll2mf += 5;
                }
                SystemCoreClock = (((HSE_VALUE / prediv2factor) * pll2mf) / prediv1factor) * pllmf;
            }
        }
#else
        /* Get PLL clock source and multiplication factor ----------------------*/
        /* Get PLLMF[3:0] */
        pllmf = RCC->GCFGR & SYS_RCC_GCFGR_PLLMF_3_0;
        /* Get PLLMF[4] */
        pllmf4 = RCC->GCFGR & RCC_GCFGR_PLLMF_4;

        pllmf4 = ((pllmf4 >> 27) * 15);
        pllmf = (pllmf >> 18) + pllmf4 + 2;


        pllselect = RCC->GCFGR & RCC_GCFGR_PLLSEL;
        if (pllselect == 0x00) {
            /* HSI clock divided by 2 selected as PLL clock source */
            SystemCoreClock = (HSI_VALUE >> SYS_HSI_CLOCK_DIVIDED_2) * pllmf;
        } else {
            if ((RCC->GCFGR & RCC_GCFGR_PLLPREDV) != (uint32_t)RESET) {
                /* HSE clock divided by 2 */
                SystemCoreClock = (HSE_VALUE >> 1) * pllmf;
            } else {
                SystemCoreClock = HSE_VALUE * pllmf;
            }
        }
#endif
        break;
    default: /* HSI used as system clock */
        SystemCoreClock = HSI_VALUE;
        break;
    }

    /* Get AHB prescaler */
    temp = RCC->GCFGR & RCC_GCFGR_AHBPS;
    temp = temp >> 4;
    presc = AHBPrescTableList[temp];
    /* Get AHB clock frequency */
    SystemCoreClock = SystemCoreClock >> presc;
}

/**
  * @brief  Configure the System clock frequency, AHB, APB2 and APB1 prescalers.
  * @param  None
  * @retval None
  */


static void SetSysClock(void)
{
#ifdef SYSCLK_FREQ_HSE
    SetSysClockToHSE();
#elif defined SYSCLK_FREQ_24MHz
    SetSysClockTo24();
#elif defined SYSCLK_FREQ_36MHz
    SetSysClockTo36();
#elif defined SYSCLK_FREQ_48MHz
    SetSysClockTo48();
#elif defined SYSCLK_FREQ_56MHz
    SetSysClockTo56();
#elif defined SYSCLK_FREQ_72MHz
    SetSysClockTo72();
#elif defined SYSCLK_FREQ_96MHz
    SetSysClockTo96();
#elif defined SYSCLK_FREQ_108MHz
    SetSysClockTo108();
#elif defined SYSCLK_FREQ_48MHz_HSI
    SetSysClockTo48HSI();
#elif defined SYSCLK_FREQ_72MHz_HSI
    SetSysClockTo72HSI();
#elif defined SYSCLK_FREQ_108MHz_HSI
    SetSysClockTo108HSI();
#endif

}

#ifdef SYSCLK_FREQ_HSE
/**
  * @brief  Select HSE as System clock source and configure AHB, APB2
  *         and APB1 prescalers.
  * @param  None
  * @retval None
  */
static void SetSysClockToHSE(void)
{
    __IO uint32_t StartUpCounter = 0, HSEStatus = 0;

    /* CK_SYS, AHB, APB2 and APB1 configuration ---------------------------*/
    /* Enable HSE */
    RCC->GCCR |= ((uint32_t)RCC_GCCR_HSEEN);

    /* Wait till HSE is ready and if Time out is reached exit */
    do {
        HSEStatus = RCC->GCCR & RCC_GCCR_HSESTB;
        StartUpCounter++;
    } while ((HSEStatus == 0) && (StartUpCounter != HSE_STARTUP_TIMEOUT));

    if ((RCC->GCCR & RCC_GCCR_HSESTB) != RESET) {
        HSEStatus = (uint32_t)0x01;
    } else {
        HSEStatus = (uint32_t)0x00;
    }

    if (HSEStatus == (uint32_t)0x01) {
        /* AHB = CK_SYS not divided */
        RCC->GCFGR |= (uint32_t)RCC_GCFGR_AHBPS_DIV1;

        /* APB2 = AHB not divided */
        RCC->GCFGR |= (uint32_t)RCC_GCFGR_APB2PS_DIV1;

        /* APB1 = AHB is divided 2 */
        RCC->GCFGR |= (uint32_t)RCC_GCFGR_APB1PS_DIV2;

        /* Select HSE as system clock source */
        RCC->GCFGR &= (uint32_t)((uint32_t)~(RCC_GCFGR_SCS));
        RCC->GCFGR |= (uint32_t)RCC_GCFGR_SCS_HSE;

        /* Wait till HSE is used as system clock source */
        while ((RCC->GCFGR & (uint32_t)RCC_GCFGR_SCSS) != (uint32_t)0x04) {
        }
    } else {
    }
}
#elif defined SYSCLK_FREQ_24MHz
/**
  * @brief  Set System clock frequency to 24MHz and configure AHB, APB1, and APB2 prescalers.
  * @note   This function should be used only after reset.
  * @param  None
  * @retval None
  */
static void SetSysClockTo24(void)
{
    __IO uint32_t StartUpCounter = 0, HSEStatus = 0;

    /* CK_SYS, AHB, APB2 and APB1 configuration ---------------------------*/
    /* Enable HSE */
    RCC->GCCR |= ((uint32_t)RCC_GCCR_HSEEN);

    /* Wait till HSE is ready and if Time out is reached exit */
    do {
        HSEStatus = RCC->GCCR & RCC_GCCR_HSESTB;
        StartUpCounter++;
    } while ((HSEStatus == 0) && (StartUpCounter != HSE_STARTUP_TIMEOUT));

    if ((RCC->GCCR & RCC_GCCR_HSESTB) != RESET) {
        HSEStatus = (uint32_t)0x01;
    } else {
        HSEStatus = (uint32_t)0x00;
    }

    if (HSEStatus == (uint32_t)0x01) {
        /* AHB = CK_SYS not divided */
        RCC->GCFGR |= (uint32_t)RCC_GCFGR_AHBPS_DIV1;

        /* APB2 = AHB not divided */
        RCC->GCFGR |= (uint32_t)RCC_GCFGR_APB2PS_DIV1;

        /* APB1 = AHB is divided 2 */
        RCC->GCFGR |= (uint32_t)RCC_GCFGR_APB1PS_DIV2;

#ifdef GD32F10X_CL
        /* Configure PLLs ------------------------------------------------------*/

