RT-Thread/rt-thread/bsp/gd32103c-eval/Libraries/CMSIS/GD/GD32F1xx/Source/system_gd32f1xx.c
        /* APB2 = AHB not divided */
        RCC->GCFGR |= (uint32_t)RCC_GCFGR_APB2PS_DIV1;

        /* APB1 = AHB is divided 2 */
        RCC->GCFGR |= (uint32_t)RCC_GCFGR_APB1PS_DIV2;

#ifdef GD32F10X_CL
        /* Configure PLLs ------------------------------------------------------*/

        /* PLL configuration: PLLCLK = PREDIV1 * 12 = 96 MHz */
        RCC->GCFGR &= (uint32_t)~(RCC_GCFGR_PLLPREDV | RCC_GCFGR_PLLSEL | RCC_GCFGR_PLLMF);
        RCC->GCFGR |= (uint32_t)(RCC_GCFGR_PLLSEL_PREDIV1 | RCC_GCFGR_PLLMF12);

        /* PLL2 configuration: PLL2CLK = (HSE / 5) * 8 = 40 MHz */
        /* PREDIV1 configuration: PREDIV1CLK = PLL2 / 5 = 8 MHz */

        RCC->GCFGR2 &= (uint32_t)~(RCC_GCFGR2_PREDV2 | RCC_GCFGR2_PLL2MF |
                                   RCC_GCFGR2_PREDV1 | RCC_GCFGR2_PREDV1SEL);
        RCC->GCFGR2 |= (uint32_t)(RCC_GCFGR2_PREDV2_DIV5 | RCC_GCFGR2_PLL2MF8 |
                                  RCC_GCFGR2_PREDV1SEL_PLL2 | RCC_GCFGR2_PREDV1_DIV5);

        /* Enable PLL2 */
        RCC->GCCR |= RCC_GCCR_PLL2EN;
        /* Wait till PLL2 is ready */
        while ((RCC->GCCR & RCC_GCCR_PLL2STB) == 0) {
        }

#else
        /* PLL configuration: PLLCLK = HSE * 12 = 96 MHz */
        RCC->GCFGR &= (uint32_t)((uint32_t)~(RCC_GCFGR_PLLSEL | RCC_GCFGR_PLLPREDV | RCC_GCFGR_PLLMF));
        RCC->GCFGR |= (uint32_t)(RCC_GCFGR_PLLPREDV_HSE | RCC_GCFGR_PLLSEL_HSE | RCC_GCFGR_PLLMF12);

#endif /* GD32F10X_CL */

        /* Enable PLL */
        RCC->GCCR |= RCC_GCCR_PLLEN;

        /* Wait till PLL is ready */
        while ((RCC->GCCR & RCC_GCCR_PLLSTB) == 0) {
        }

        /* Select PLL as system clock source */
        RCC->GCFGR &= (uint32_t)((uint32_t)~(RCC_GCFGR_SCS));
        RCC->GCFGR |= (uint32_t)RCC_GCFGR_SCS_PLL;

        /* Wait till PLL is used as system clock source */
        while ((RCC->GCFGR & (uint32_t)RCC_GCFGR_SCSS) != (uint32_t)0x08) {
        }
    } else {
    }
}

#elif defined SYSCLK_FREQ_108MHz
/**
  * @brief  Set System clock frequency to 108MHz and configure AHB, APB1, and APB2 prescalers.
  * @note   This function should be used only after reset.
  * @param  None
  * @retval None
  */
static void SetSysClockTo108(void)
{
    __IO uint32_t StartUpCounter = 0, HSEStatus = 0;

    /* CK_SYS, AHB, APB2 and APB1 configuration ---------------------------*/
    /* Enable HSE */
    RCC->GCCR |= ((uint32_t)RCC_GCCR_HSEEN);

    /* Wait till HSE is ready and if Time out is reached exit */
    do {
        HSEStatus = RCC->GCCR & RCC_GCCR_HSESTB;
        StartUpCounter++;
    } while ((HSEStatus == 0) && (StartUpCounter != HSE_STARTUP_TIMEOUT));

    if ((RCC->GCCR & RCC_GCCR_HSESTB) != RESET) {
        HSEStatus = (uint32_t)0x01;
    } else {
        HSEStatus = (uint32_t)0x00;
    }

    if (HSEStatus == (uint32_t)0x01) {
        /* AHB = CK_SYS not divided */
        RCC->GCFGR |= (uint32_t)RCC_GCFGR_AHBPS_DIV1;
        /* APB2 = AHB not divided */
        RCC->GCFGR |= (uint32_t)RCC_GCFGR_APB2PS_DIV1;
        /* APB1 = AHB is divided 2 */
        RCC->GCFGR |= (uint32_t)RCC_GCFGR_APB1PS_DIV2;

#ifdef GD32F10X_CL
        /* Configure PLLs ------------------------------------------------------*/

        /* PLL configuration: PLLCLK = PREDIV1 * 9 = 108 MHz */
        RCC->GCFGR &= (uint32_t)~(RCC_GCFGR_PLLPREDV | RCC_GCFGR_PLLSEL | RCC_GCFGR_PLLMF);
        RCC->GCFGR |= (uint32_t)(RCC_GCFGR_PLLPREDV_PREDIV1 | RCC_GCFGR_PLLSEL_PREDIV1 | RCC_GCFGR_PLLMF9);

        /* PLL2 configuration: PLL2CLK = (HSE / 5) * 12 = 60 MHz */
        /* PREDIV1 configuration: PREDIV1CLK = PLL2 / 5 = 12 MHz */

        RCC->GCFGR2 &= (uint32_t)~(RCC_GCFGR2_PREDV2 | RCC_GCFGR2_PLL2MF |
                                   RCC_GCFGR2_PREDV1 | RCC_GCFGR2_PREDV1SEL);
        RCC->GCFGR2 |= (uint32_t)(RCC_GCFGR2_PREDV2_DIV5 | RCC_GCFGR2_PLL2MF12 |
                                  RCC_GCFGR2_PREDV1SEL_PLL2 | RCC_GCFGR2_PREDV1_DIV5);

        /* Enable PLL2 */
        RCC->GCCR |= RCC_GCCR_PLL2EN;
        /* Wait till PLL2 is ready */
        while ((RCC->GCCR & RCC_GCCR_PLL2STB) == 0) {
        }

#else
        /* PLL configuration: PLLCLK = (HSE/2) * 27 = 108 MHz */
        RCC->GCFGR &= (uint32_t)((uint32_t)~(RCC_GCFGR_PLLSEL | RCC_GCFGR_PLLPREDV | RCC_GCFGR_PLLMF));
        RCC->GCFGR |= (uint32_t)(RCC_GCFGR_PLLPREDV_HSE_DIV2 | RCC_GCFGR_PLLSEL_HSE | RCC_GCFGR_PLLMF27);

#endif /* GD32F10X_CL */

        /* Enable PLL */
        RCC->GCCR |= RCC_GCCR_PLLEN;

        /* Wait till PLL is ready */
        while ((RCC->GCCR & RCC_GCCR_PLLSTB) == 0) {
        }

        /* Select PLL as system clock source */
        RCC->GCFGR &= (uint32_t)((uint32_t)~(RCC_GCFGR_SCS));
        RCC->GCFGR |= (uint32_t)RCC_GCFGR_SCS_PLL;

        /* Wait till PLL is used as system clock source */
        while ((RCC->GCFGR & (uint32_t)RCC_GCFGR_SCSS) != (uint32_t)0x08) {
        }
    } else {
    }
}
#elif defined SYSCLK_FREQ_48MHz_HSI
/**
  * @brief  Set System clock frequency to 48MHz and configure AHB, APB1, and APB2 prescalers.
  * @note   This function should be used only after reset.
  * @param  None
  * @retval None
  */
static void SetSysClockTo48HSI(void)
{
    __IO uint32_t StartUpCounter = 0, HSEStatus = 0;

    /* CK_SYS, AHB, APB2 and APB1 configuration ---------------------------*/

    /* AHB = CK_SYS not divided */
    RCC->GCFGR |= (uint32_t)RCC_GCFGR_AHBPS_DIV1;

    /* APB2 = AHB not divided */
    RCC->GCFGR |= (uint32_t)RCC_GCFGR_APB2PS_DIV1;

    /* APB1 = AHB is divided 2 */
    RCC->GCFGR |= (uint32_t)RCC_GCFGR_APB1PS_DIV2;

    /* Configure PLLs ------------------------------------------------------*/

    /* PLL configuration: PLLCLK = (HSI/2) * 12 = 48 MHz */
    RCC->GCFGR &= (uint32_t)((uint32_t)~(RCC_GCFGR_PLLSEL | RCC_GCFGR_PLLMF));
    RCC->GCFGR |= (uint32_t)(RCC_GCFGR_PLLSEL_HSI_DIV2 | RCC_GCFGR_PLLMF12);

    /* Enable PLL */
    RCC->GCCR |= RCC_GCCR_PLLEN;

    /* Wait till PLL is ready */
    while ((RCC->GCCR & RCC_GCCR_PLLSTB) == 0) {
    }

    /* Select PLL as system clock source */
    RCC->GCFGR &= (uint32_t)((uint32_t)~(RCC_GCFGR_SCS));
    RCC->GCFGR |= (uint32_t)RCC_GCFGR_SCS_PLL;

    /* Wait till PLL is used as system clock source */
    while ((RCC->GCFGR & (uint32_t)RCC_GCFGR_SCSS) != (uint32_t)0x08) {
    }
}
#elif defined SYSCLK_FREQ_72MHz_HSI
/**
  * @brief  Set System clock frequency to 72MHz and configure AHB, APB1, and APB2 prescalers.
  * @note   This function should be used only after reset.
  * @param  None
  * @retval None
  */
static void SetSysClockTo72HSI(void)
{
    __IO uint32_t StartUpCounter = 0, HSEStatus = 0;

    /* CK_SYS, AHB, APB2 and APB1 configuration ---------------------------*/

    /* AHB = CK_SYS not divided */
    RCC->GCFGR |= (uint32_t)RCC_GCFGR_AHBPS_DIV1;

